MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F120H8TA/mcu.h
/*  Bit definition for GPIO_POTR3 register  */
#define GPIO_POTR3_POT0_POS                            (0U)
#define GPIO_POTR3_POT0                                (0x01U)
#define GPIO_POTR3_POT1_POS                            (1U)
#define GPIO_POTR3_POT1                                (0x02U)

/*  Bit definition for GPIO_POTR4 register  */
#define GPIO_POTR4_POT0_POS                            (0U)
#define GPIO_POTR4_POT0                                (0x01U)
#define GPIO_POTR4_POT1_POS                            (1U)
#define GPIO_POTR4_POT1                                (0x02U)

/*  Bit definition for GPIO_POTR5 register  */
#define GPIO_POTR5_POT0_POS                            (0U)
#define GPIO_POTR5_POT0                                (0x01U)
#define GPIO_POTR5_POT1_POS                            (1U)
#define GPIO_POTR5_POT1                                (0x02U)

/*  Bit definition for GPIO_POTR6 register  */
#define GPIO_POTR6_POT0_POS                            (0U)
#define GPIO_POTR6_POT0                                (0x01U)
#define GPIO_POTR6_POT1_POS                            (1U)
#define GPIO_POTR6_POT1                                (0x02U)
#define GPIO_POTR6_POT2_POS                            (2U)
#define GPIO_POTR6_POT2                                (0x04U)
#define GPIO_POTR6_POT3_POS                            (3U)
#define GPIO_POTR6_POT3                                (0x08U)

/*  Bit definition for GPIO_POTR7 register  */
#define GPIO_POTR7_POT0_POS                            (0U)
#define GPIO_POTR7_POT0                                (0x01U)
#define GPIO_POTR7_POT1_POS                            (1U)
#define GPIO_POTR7_POT1                                (0x02U)
#define GPIO_POTR7_POT2_POS                            (2U)
#define GPIO_POTR7_POT2                                (0x04U)
#define GPIO_POTR7_POT3_POS                            (3U)
#define GPIO_POTR7_POT3                                (0x08U)

/*  Bit definition for GPIO_POTR12 register  */
#define GPIO_POTR12_POT0_POS                           (0U)
#define GPIO_POTR12_POT0                               (0x01U)
#define GPIO_POTR12_POT1_POS                           (1U)
#define GPIO_POTR12_POT1                               (0x02U)
#define GPIO_POTR12_POT2_POS                           (2U)
#define GPIO_POTR12_POT2                               (0x04U)
#define GPIO_POTR12_POT3_POS                           (3U)
#define GPIO_POTR12_POT3                               (0x08U)
#define GPIO_POTR12_POT4_POS                           (4U)
#define GPIO_POTR12_POT4                               (0x10U)

/*  Bit definition for GPIO_POTR13 register  */
#define GPIO_POTR13_POT7_POS                           (7U)
#define GPIO_POTR13_POT7                               (0x80U)

/*  Bit definition for GPIO_POTR14 register  */
#define GPIO_POTR14_POT6_POS                           (6U)
#define GPIO_POTR14_POT6                               (0x40U)
#define GPIO_POTR14_POT7_POS                           (7U)
#define GPIO_POTR14_POT7                               (0x80U)

/*  Bit definition for GPIO_PCR register  */
#define GPIO_PCR_POUT_POS                              (0U)
#define GPIO_PCR_POUT                                  (0x0001U)
#define GPIO_PCR_POUTE_POS                             (1U)
#define GPIO_PCR_POUTE                                 (0x0002U)
#define GPIO_PCR_NOD_POS                               (2U)
#define GPIO_PCR_NOD                                   (0x0004U)
#define GPIO_PCR_DRV_POS                               (4U)
#define GPIO_PCR_DRV                                   (0x0010U)
#define GPIO_PCR_LTE_POS                               (5U)
#define GPIO_PCR_LTE                                   (0x0020U)
#define GPIO_PCR_PUU_POS                               (6U)
#define GPIO_PCR_PUU                                   (0x0040U)
#define GPIO_PCR_PIN_POS                               (8U)
#define GPIO_PCR_PIN                                   (0x0100U)
#define GPIO_PCR_INVE_POS                              (9U)
#define GPIO_PCR_INVE                                  (0x0200U)
#define GPIO_PCR_CINSEL_POS                            (10U)
#define GPIO_PCR_CINSEL                                (0x0400U)
#define GPIO_PCR_INTE_POS                              (11U)
#define GPIO_PCR_INTE                                  (0x0800U)
#define GPIO_PCR_FSEL_POS                              (12U)
#define GPIO_PCR_FSEL                                  (0x7000U)
#define GPIO_PCR_FSEL_0                                (0x1000U)
#define GPIO_PCR_FSEL_1                                (0x2000U)
#define GPIO_PCR_FSEL_2                                (0x4000U)

/*  Bit definition for GPIO_PSPCR register  */
#define GPIO_PSPCR_SPFE                                (0x0003U)
#define GPIO_PSPCR_SPFE_0                              (0x0001U)
#define GPIO_PSPCR_SPFE_1                              (0x0002U)

/*  Bit definition for GPIO_PCCR register  */
#define GPIO_PCCR_RDWT_POS                             (14U)
#define GPIO_PCCR_RDWT                                 (0xC000U)
#define GPIO_PCCR_RDWT_0                               (0x4000U)
#define GPIO_PCCR_RDWT_1                               (0x8000U)

/*  Bit definition for GPIO_PINAER register  */
#define GPIO_PINAER_PINAE0_POS                         (0U)
#define GPIO_PINAER_PINAE0                             (0x0001U)
#define GPIO_PINAER_PINAE1_POS                         (1U)
#define GPIO_PINAER_PINAE1                             (0x0002U)
#define GPIO_PINAER_PINAE2_POS                         (2U)
#define GPIO_PINAER_PINAE2                             (0x0004U)
#define GPIO_PINAER_PINAE3_POS                         (3U)
#define GPIO_PINAER_PINAE3                             (0x0008U)
#define GPIO_PINAER_PINAE4_POS                         (4U)
#define GPIO_PINAER_PINAE4                             (0x0010U)
#define GPIO_PINAER_PINAE5_POS                         (5U)
#define GPIO_PINAER_PINAE5                             (0x0020U)
#define GPIO_PINAER_PINAE6_POS                         (6U)
#define GPIO_PINAER_PINAE6                             (0x0040U)
#define GPIO_PINAER_PINAE7_POS                         (7U)
#define GPIO_PINAER_PINAE7                             (0x0080U)
#define GPIO_PINAER_PINAE12_POS                        (12U)
#define GPIO_PINAER_PINAE12                            (0x1000U)
#define GPIO_PINAER_PINAE13_POS                        (13U)
#define GPIO_PINAER_PINAE13                            (0x2000U)
#define GPIO_PINAER_PINAE14_POS                        (14U)
#define GPIO_PINAER_PINAE14                            (0x4000U)

/*  Bit definition for GPIO_PWPR register  */
#define GPIO_PWPR_WE_POS                               (0U)
#define GPIO_PWPR_WE                                   (0x0001U)
#define GPIO_PWPR_WP_POS                               (8U)
#define GPIO_PWPR_WP                                   (0xFF00U)
#define GPIO_PWPR_WP_0                                 (0x0100U)
#define GPIO_PWPR_WP_1                                 (0x0200U)
#define GPIO_PWPR_WP_2                                 (0x0400U)
#define GPIO_PWPR_WP_3                                 (0x0800U)
#define GPIO_PWPR_WP_4                                 (0x1000U)
#define GPIO_PWPR_WP_5                                 (0x2000U)
#define GPIO_PWPR_WP_6                                 (0x4000U)
#define GPIO_PWPR_WP_7                                 (0x8000U)

