MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F120H8TA/mcu.h
typedef struct {
    stc_adc_str_bit_t                        STR_b;
    uint32_t                                 RESERVED0[8];
    stc_adc_cr0_bit_t                        CR0_b;
    stc_adc_cr1_bit_t                        CR1_b;
    uint32_t                                 RESERVED1[32];
    stc_adc_trgsr_bit_t                      TRGSR_b;
    uint32_t                                 RESERVED2[96];
    stc_adc_exchselr_bit_t                   EXCHSELR_b;
    uint32_t                                 RESERVED3[344];
    stc_adc_isr_bit_t                        ISR_b;
    stc_adc_icr_bit_t                        ICR_b;
    stc_adc_isclrr_bit_t                     ISCLRR_b;
    uint32_t                                 RESERVED4[712];
    stc_adc_awdcr_bit_t                      AWDCR_b;
    stc_adc_awdsr_bit_t                      AWDSR_b;
    stc_adc_awdsclrr_bit_t                   AWDSCLRR_b;
} bCM_ADC_TypeDef;

typedef struct {
    stc_aos_intc_strgcr_bit_t                INTC_STRGCR_b;
} bCM_AOS_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_cmu_xtalstdsr_bit_t                  XTALSTDSR_b;
    uint32_t                                 RESERVED1[88];
    stc_cmu_xtalcr_bit_t                     XTALCR_b;
    uint32_t                                 RESERVED2[24];
    stc_cmu_xtalcfgr_bit_t                   XTALCFGR_b;
    uint32_t                                 RESERVED3[24];
    stc_cmu_hrccr_bit_t                      HRCCR_b;
    uint32_t                                 RESERVED4[56];
    stc_cmu_oscstbsr_bit_t                   OSCSTBSR_b;
    uint32_t                                 RESERVED5[24];
    stc_cmu_mcocfgr_bit_t                    MCO1CFGR_b;
    uint32_t                                 RESERVED6[24];
    stc_cmu_xtalstdcr_bit_t                  XTALSTDCR_b;
    uint32_t                                 RESERVED7[56];
    stc_cmu_fcg_bit_t                        FCG_b;
    uint32_t                                 RESERVED8[64];
    stc_cmu_lrccr_bit_t                      LRCCR_b;
} bCM_CMU_TypeDef;

typedef struct {
    stc_crc_cr_bit_t                         CR_b;
} bCM_CRC_TypeDef;

typedef struct {
    stc_ctc_cr1_bit_t                        CR1_b;
    uint32_t                                 RESERVED0[32];
    stc_ctc_str_bit_t                        STR_b;
} bCM_CTC_TypeDef;

typedef struct {
    stc_dbgc_mcudbgstat_bit_t                MCUDBGSTAT_b;
    stc_dbgc_mcustpctl_bit_t                 MCUSTPCTL_b;
} bCM_DBGC_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_efm_fstp_bit_t                       FSTP_b;
    stc_efm_frmc_bit_t                       FRMC_b;
    stc_efm_fwmc_bit_t                       FWMC_b;
    stc_efm_fsr_bit_t                        FSR_b;
    stc_efm_fsclr_bit_t                      FSCLR_b;
    stc_efm_fite_bit_t                       FITE_b;
    uint32_t                                 RESERVED1[4928];
    stc_efm_lvdicgcr_bit_t                   LVDICGCR_b;
} bCM_EFM_TypeDef;

typedef struct {
    stc_gpio_pidr0_bit_t                     PIDR0_b;
    stc_gpio_pidr1_bit_t                     PIDR1_b;
    stc_gpio_pidr2_bit_t                     PIDR2_b;
    stc_gpio_pidr3_bit_t                     PIDR3_b;
    stc_gpio_pidr4_bit_t                     PIDR4_b;
    stc_gpio_pidr5_bit_t                     PIDR5_b;
    stc_gpio_pidr6_bit_t                     PIDR6_b;
    stc_gpio_pidr7_bit_t                     PIDR7_b;
    uint32_t                                 RESERVED0[32];
    stc_gpio_pidr12_bit_t                    PIDR12_b;
    stc_gpio_pidr13_bit_t                    PIDR13_b;
    stc_gpio_pidr14_bit_t                    PIDR14_b;
    uint32_t                                 RESERVED1[8];
    stc_gpio_podr0_bit_t                     PODR0_b;
    stc_gpio_podr1_bit_t                     PODR1_b;
    stc_gpio_podr2_bit_t                     PODR2_b;
    stc_gpio_podr3_bit_t                     PODR3_b;
    stc_gpio_podr4_bit_t                     PODR4_b;
    stc_gpio_podr5_bit_t                     PODR5_b;
    stc_gpio_podr6_bit_t                     PODR6_b;
    stc_gpio_podr7_bit_t                     PODR7_b;
    uint32_t                                 RESERVED2[32];
    stc_gpio_podr12_bit_t                    PODR12_b;
    stc_gpio_podr13_bit_t                    PODR13_b;
    stc_gpio_podr14_bit_t                    PODR14_b;
    uint32_t                                 RESERVED3[8];
    stc_gpio_poer0_bit_t                     POER0_b;
    stc_gpio_poer1_bit_t                     POER1_b;
    stc_gpio_poer2_bit_t                     POER2_b;
    stc_gpio_poer3_bit_t                     POER3_b;
    stc_gpio_poer4_bit_t                     POER4_b;
    stc_gpio_poer5_bit_t                     POER5_b;
    stc_gpio_poer6_bit_t                     POER6_b;
    stc_gpio_poer7_bit_t                     POER7_b;
    uint32_t                                 RESERVED4[32];
    stc_gpio_poer12_bit_t                    POER12_b;
    stc_gpio_poer13_bit_t                    POER13_b;
    stc_gpio_poer14_bit_t                    POER14_b;
    uint32_t                                 RESERVED5[8];
    stc_gpio_posr0_bit_t                     POSR0_b;
    stc_gpio_posr1_bit_t                     POSR1_b;
    stc_gpio_posr2_bit_t                     POSR2_b;
    stc_gpio_posr3_bit_t                     POSR3_b;
    stc_gpio_posr4_bit_t                     POSR4_b;
    stc_gpio_posr5_bit_t                     POSR5_b;
    stc_gpio_posr6_bit_t                     POSR6_b;
    stc_gpio_posr7_bit_t                     POSR7_b;
    uint32_t                                 RESERVED6[32];
    stc_gpio_posr12_bit_t                    POSR12_b;
    stc_gpio_posr13_bit_t                    POSR13_b;
    stc_gpio_posr14_bit_t                    POSR14_b;
    uint32_t                                 RESERVED7[8];
    stc_gpio_porr0_bit_t                     PORR0_b;
    stc_gpio_porr1_bit_t                     PORR1_b;
    stc_gpio_porr2_bit_t                     PORR2_b;
    stc_gpio_porr3_bit_t                     PORR3_b;
    stc_gpio_porr4_bit_t                     PORR4_b;
    stc_gpio_porr5_bit_t                     PORR5_b;
    stc_gpio_porr6_bit_t                     PORR6_b;
    stc_gpio_porr7_bit_t                     PORR7_b;
    uint32_t                                 RESERVED8[32];
    stc_gpio_porr12_bit_t                    PORR12_b;
    stc_gpio_porr13_bit_t                    PORR13_b;
    stc_gpio_porr14_bit_t                    PORR14_b;
    uint32_t                                 RESERVED9[8];
    stc_gpio_potr0_bit_t                     POTR0_b;
    stc_gpio_potr1_bit_t                     POTR1_b;
    stc_gpio_potr2_bit_t                     POTR2_b;
    stc_gpio_potr3_bit_t                     POTR3_b;
    stc_gpio_potr4_bit_t                     POTR4_b;
    stc_gpio_potr5_bit_t                     POTR5_b;
    stc_gpio_potr6_bit_t                     POTR6_b;
    stc_gpio_potr7_bit_t                     POTR7_b;
    uint32_t                                 RESERVED10[32];
    stc_gpio_potr12_bit_t                    POTR12_b;
    stc_gpio_potr13_bit_t                    POTR13_b;
    stc_gpio_potr14_bit_t                    POTR14_b;
    uint32_t                                 RESERVED11[7432];
    stc_gpio_pcr_bit_t                       PCR00_b;
    stc_gpio_pcr_bit_t                       PCR01_b;
    uint32_t                                 RESERVED12[96];
    stc_gpio_pcr_bit_t                       PCR10_b;
    stc_gpio_pcr_bit_t                       PCR11_b;
    stc_gpio_pcr_bit_t                       PCR12_b;
    stc_gpio_pcr_bit_t                       PCR13_b;
    stc_gpio_pcr_bit_t                       PCR14_b;
    stc_gpio_pcr_bit_t                       PCR15_b;
    stc_gpio_pcr_bit_t                       PCR16_b;
    stc_gpio_pcr_bit_t                       PCR17_b;
    stc_gpio_pcr_bit_t                       PCR20_b;
    stc_gpio_pcr_bit_t                       PCR21_b;
    stc_gpio_pcr_bit_t                       PCR22_b;
    stc_gpio_pcr_bit_t                       PCR23_b;
    stc_gpio_pcr_bit_t                       PCR24_b;
    stc_gpio_pcr_bit_t                       PCR25_b;
    stc_gpio_pcr_bit_t                       PCR26_b;
    stc_gpio_pcr_bit_t                       PCR27_b;
    stc_gpio_pcr_bit_t                       PCR30_b;
    stc_gpio_pcr_bit_t                       PCR31_b;
    uint32_t                                 RESERVED13[96];
    stc_gpio_pcr_bit_t                       PCR40_b;
    stc_gpio_pcr_bit_t                       PCR41_b;
    uint32_t                                 RESERVED14[96];
    stc_gpio_pcr_bit_t                       PCR50_b;
    stc_gpio_pcr_bit_t                       PCR51_b;
    uint32_t                                 RESERVED15[96];
    stc_gpio_pcr_bit_t                       PCR60_b;
    stc_gpio_pcr_bit_t                       PCR61_b;
    stc_gpio_pcr_bit_t                       PCR62_b;
    stc_gpio_pcr_bit_t                       PCR63_b;
    uint32_t                                 RESERVED16[64];
    stc_gpio_pcr_bit_t                       PCR70_b;
    stc_gpio_pcr_bit_t                       PCR71_b;
    stc_gpio_pcr_bit_t                       PCR72_b;
    stc_gpio_pcr_bit_t                       PCR73_b;
    uint32_t                                 RESERVED17[576];
    stc_gpio_pcr_bit_t                       PCR120_b;
    stc_gpio_pcr_bit_t                       PCR121_b;
    stc_gpio_pcr_bit_t                       PCR122_b;
    stc_gpio_pcr_bit_t                       PCR123_b;
    stc_gpio_pcr_bit_t                       PCR124_b;
    uint32_t                                 RESERVED18[160];
    stc_gpio_pcr_bit_t                       PCR137_b;
    uint32_t                                 RESERVED19[96];
    stc_gpio_pcr_bit_t                       PCR146_b;
    stc_gpio_pcr_bit_t                       PCR147_b;
    uint32_t                                 RESERVED20[176];
    stc_gpio_pinaer_bit_t                    PINAER_b;
    stc_gpio_pwpr_bit_t                      PWPR_b;
} bCM_GPIO_TypeDef;

